/* 
   Localizable.strings
   Sprouted AVI

   Created by Philip Dow on 4/22/08.
   Copyright 2008 Sprouted. All rights reserved.
 */

"record audio title" = "Record Audio";
"record video title" = "Record Video";
"take snapshot title" = "Take a Picture";
"preferences title" = "Options";

"default artist" = "Untitled Artist";
"default album" = "My Recordings";
"default playlist" = "My Recordings";

"no video capture msg" = "Video capture unavailable.";
"no video capture info" = "There was a problem connecting to your video camera. Check your device connections and try again.";

"no audio capture msg" = "Audio recording is unavailable.";
"no audio capture info" = "There was a problem connectiong to your microphone. Check your device connections and try again.";

"no snapshot capture msg" = "Snapshot is unavailable.";
"no snapshot capture info" = "There was a problem connecting to your camera. Check your device connections and try again.";


"lameinstall success title" = "Components successfully installed";
"lameinstall success msg" = "The LAME encoding components were successfully installed. It may be necessary to relaunch the application before they are available.";
	
"lameinstall failure title" = "Components not installed";
"lameinstall failure msg" = "Sprouted AVI was unable to install the LAME encoding components. For instructions on installing LAME yourself, please see the additional documents that came with the application.";

"lameinstall required title" = "Install MP3 encoder?";
"lameinstall required msg" = "Sprouted AVI requires the LAME MP3 encoder to save your audio recordings as MP3 files. Would you like to install it now?";
"lameinstall required yes" = "Install";
"lameinstall required no" = "Cancel";


"stop description" = "Stop";
"play description" = "Play";


"mp3 prepare" = "Preparing to convert audio recording to MP3…";
"mp3 convert" = "Converting audio recording to MP3…";
"mp3 tag" = "Tagging MP3…";
"mp3 import" = "Adding recording to iTunes…";
"mp3 save" = "Saving MP3 to disk…";
"mp3 clean" = "Cleaning up…";
"mov tag" = "Tagging movie…";


"untitled audio recording" = "Untitled Recording";


"audio recording error title" = "Recording Error";
"video recording error title" = "Recording Error";

"audio recording error cant start msg" = "There was a problem beginning the recording. You might try re-starting the application.";
"audio recording error saved file unreadable msg" = "There was a problem reading the saved recording. It may be corrupted. You might try recording again.";
"audio recording error script msg" = "The iTunes MP3 import script could not be located. It may be necessary to re-install the application, or uncheck the iTunes option.";
"audio conversion error cant write msg" = "There was a problem saving the file as an MP3. You might try disabling MP3 conversion and making the recording again.";


"audio conversion error no encoder title" = "There was a problem loading the MP3 converter";
"audio conversion error no encoder msg" = "You might try relaunching the application or saving your recording as a QuickTime movie.";


"video recording unable to stop msg" = "There was a problem ending the recording. You may need to quit the application and try again.";
"video recording cant load msg" = "There was a problem reading the saved recording. It may be corrupted. You might try recording again.";


"still recording description" = "A recording is in progress";
"still recording recovery" = "You must stop recording before leaving this session";
"still recording stop" = "Stop Recording";
"still recording cancel" = "Cancel";

"unsaved changes description" = "You have an unsaved recording";
"unsaved changes recovery" = "Your recording will be lost if you do not save it";
"unsaved changes save" = "Save";
"unsaved changes dont save" = "Don't Save";
"unsaved changes cancel" = "Cancel";
